usb-c/STUSB1602/firmware/FW_for_STM32L4R5/src/Drivers/BSP/P-NUCLEO-L4R5/p-nucleo-L4R5.h
/**
  ******************************************************************************
  * @file    p-nucleo-L4R5.h
  * @author  MCD Application Team
  * @brief   This file contains the headers of p-nucleo-usb002.c file.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/*#warning "P-Nucleo header bof"*/
#ifndef __P_NUCLEO_L4R5_H_
#define __P_NUCLEO_L4R5_H_
/*#warning "P-Nucleo header bof2"*/
#ifdef __cplusplus
extern "C"
{
#endif
 
/**
  * @addtogroup BSP
  * @{
  * */

/**
  * @addtogroup P-NUCLEO-USB002
  * @{
  * */

/* Includes ------------------------------------------------------------------*/
#if defined(STM32L4R5xx)

#include "stm32l4xx.h"
#include "stm32l4xx_ll_utils.h"
#include "stm32l4xx_ll_system.h"
#include "stm32l4xx_ll_rcc.h"
#include "stm32l4xx_ll_exti.h" 
#include "stm32l4xx_ll_bus.h"
#include "stm32l4xx_ll_tim.h"
#include "stm32l4xx_ll_usart.h"
#include "stm32l4xx_ll_crc.h"
#include "stm32l4xx_ll_spi.h"
#include "stm32l4xx_ll_cortex.h"  
#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_dma.h"
#include "stm32l4xx_ll_pwr.h"
#if defined(_OPTIM_CONSO)
#include "stm32l4xx_ll_rtc.h"
#include "stm32l4xx_ll_adc.h"
#include "stm32l4xx_hal_adc.h"
#endif /* _OPTIM_CONSO_ */  
#else
#error "Add include for the family!"
#endif

  
#define TIMx                           TIM4
#define TIMx_Clock_Freq                (SystemCoreClock )
#define TIMx_CLK_ENABLE                __HAL_RCC_TIM4_CLK_ENABLE()
//#define TIMx_IRQ                       TIM4_IRQn
#if (USBPD_PORT_COUNT == 2)
#define TIM_PE                         TIM8
#define TIM_PE_Clock_Freq              (SystemCoreClock )        // depend on APB clock freq timer is connected 
#define TIM_PE_CLK_ENABLE              __HAL_RCC_TIM8_CLK_ENABLE()
#endif  


#define SPI_ENTER_CRITICAL_SECTION()// uint32_t primask= __get_PRIMASK();\ 
                                    //   __disable_irq();

#define SPI_LEAVE_CRITICAL_SECTION() // __set_PRIMASK(primask)
  
/** @defgroup P-NUCLEO-USB001_Exported_Macros Exported Macros
  * @{
  */
#define USBPD_BSP_PIN(PORT,PIN)    { PORT, GPIO_PIN_ ## PIN, 0 }
#define USBPD_BSP_ADC(PORT,PIN,CH,RANK) { PORT, GPIO_PIN_ ## PIN, CH, RANK }

#define USBPD_LOWEST_IRQ_PRIO   15   /*!< Lowest priority                    */
#define USBPD_LOW_IRQ_PRIO      10   /*!< High priority shift value          */
#define USBPD_HIGH_IRQ_PRIO     5   /*!< Low priority shift value           */
#define RX_IRQ_PRIO             6   /*!< Rx priority for first interrupt @note Communication is half duplex so @ref TX_IRQ_PRIO = @ref RX_IRQ_PRIO */
#define TX_IRQ_PRIO             6   /*!< Tx interrupt priority @note Communication is half duplex so @ref TX_IRQ_PRIO = @ref RX_IRQ_PRIO */

#define SPI_ENTER_CRITICAL_SECTION()// uint32_t primask= __get_PRIMASK();\ 
                                    //   __disable_irq();

#define SPI_LEAVE_CRITICAL_SECTION() // __set_PRIMASK(primask)

/**
  * @brief This struct contains parameter used to define array of pins
  */
typedef struct
{
      GPIO_TypeDef*   GPIOx;      /*!< The GPIO Port of the Pin */
      uint16_t        GPIO_Pin;   /*!< The GPIO_Pin */
      uint32_t        ADCCH;      /*!< The ADC Channel if used */
} USBPD_BSP_GPIOPins_TypeDef;

typedef struct
{
      GPIO_TypeDef*   GPIOx;      /*!< The GPIO Port of the Pin */
      uint16_t        GPIO_Pin;   /*!< The GPIO_Pin */
      uint32_t        ADCCH;      /*!< The ADC Channel if used */
      uint32_t        RANK;       /*!< The ADC Rank if used */
} USBPD_BSP_GPIOADCPins_TypeDef;

void USBPD_HW_IF_GPIO_Set(USBPD_BSP_GPIOPins_TypeDef gpio, GPIO_PinState PinState);
void USBPD_HW_IF_GPIO_On(USBPD_BSP_GPIOPins_TypeDef gpio);
void USBPD_HW_IF_GPIO_Off(USBPD_BSP_GPIOPins_TypeDef gpio);
void USBPD_HW_IF_GPIO_Toggle(USBPD_BSP_GPIOPins_TypeDef gpio);

/**
  * @}
  */

/** @defgroup P-NUCLEO-USB002_Exported_Types Exported Types
  * @{
  */
/** @defgroup USBPD_DEVICE_PORTHANDLE_STUSB1602_IOs STUSB1602 IOs
  *   @brief All those macro are used to define the HW setup on MCU side
  * @{
  */

/* GPIOs */
#define TX_EN_GPIO_PORT(__PORT__)           ( GPIOC )                                       /*!< TX_EN GPIO Port           */
#define TX_EN_GPIO_PIN(__PORT__)            ((__PORT__ == 0) ? GPIO_PIN_2 : GPIO_PIN_3 )    /*!< TX_EN GPIO Pin            */
#define RESET_GPIO_PORT(__PORT__)           ( GPIOC )                                       /*!< RESET GPIO Port           */
#define RESET_GPIO_PIN(__PORT__)            ((__PORT__ == 0) ? GPIO_PIN_6 : GPIO_PIN_7 )    /*!< RESET GPIO PIN            */
#define A_B_Side_GPIO_PORT(__PORT__)        ( GPIOA )                                       /*!< A_B Side GPIO Port        */
#define A_B_Side_GPIO_PIN(__PORT__)         ((__PORT__ == 0) ? GPIO_PIN_0 : GPIO_PIN_3 )    /*!< A_B Side GPIO Pin         */
#define ALERT_PORT_INDEX(__PORT__)          ((__PORT__ == 0) ? 0 : 1 )                      /*!< ALERT Pin index           */
#define ALERT_GPIO_PORT(__PORT__)           ( GPIOA )                                       /*!< ALERT GPIO Port           */
#define ALERT_GPIO_PIN(__PORT__)            ((__PORT__ == 0) ? GPIO_PIN_1 : GPIO_PIN_2 )    /*!< ALERT GPIO Pin            */
#define ALERT_GPIO_IRQHANDLER(__PORT__)     ((__PORT__ == 0) ? EXTI1_IRQn : EXTI2_IRQn )/*!< ALERT GPIO IRQn           */
#define ALERT_GPIO_IRQPRIORITY(__PORT__)    ( USBPD_LOW_IRQ_PRIO )                          /*!< ALERT IRQ priority        */

/* I2C */
#define I2C_INSTANCE(__PORT__)                  ((__PORT__ == 0) ? I2C2  : I2C2)                   /*!< I2C: Device           */

