usb-c/STUSB1602/firmware/FW_for_STM32L4R5/src/Drivers/BSP/P-NUCLEO-L4R5/p-nucleo-L4R5.h
#define I2C_TIMING(__PORT__)                    ((__PORT__ == 0) ? 0x00501E6C  : 0x00501E6C )       /*!< I2C: Timing value     */

#define I2C_PORT(__PORT__)                      ( GPIOB )                                          /*!< I2C: GPIO Port        */
#define I2C_SCL_PIN(__PORT__)                   ( GPIO_PIN_10 )     /*!< I2C: SCL Pin          */
#define I2C_SCL_PORT(__PORT__)                  ( GPIOB )                                          /*!< I2C: SCL Port         */
#define I2C_SDA_PIN(__PORT__)                   ( GPIO_PIN_11 )     /*!< I2C: SDA Pin          */
#define I2C_SDA_PORT(__PORT__)                  ( GPIOB)                                           /*!< I2C: SDA Port         */
#define I2C_MODE(__PORT__)                      ( GPIO_MODE_AF_OD )                                /*!< I2C: GPIO Mode        */
#define I2C_PULL(__PORT__)                      ( GPIO_NOPULL )                                    /*!< I2C: Pull Setup       */
#define I2C_SPEED(__PORT__)                     ( GPIO_SPEED_FREQ_HIGH )                           /*!< I2C: GPIO Speed       */
#define I2C_ALTERNATE(__PORT__)                 ( GPIO_AF4_I2C2 ) /*!< I2C: GPIO Alternate Function */

/* SPI */
#define SPI_Instance(__PORT__)                  ((__PORT__ == 0) ? SPI2                  : SPI1 )                   /*!< SPI: Device           */
#define SPI_NSS_PORT(__PORT__)                  ((__PORT__ == 0) ? GPIOB                 : GPIOA )                  /*!< SPI: NSS Port         */
#define SPI_NSS_PIN(__PORT__)                   ((__PORT__ == 0) ? GPIO_PIN_12           : GPIO_PIN_15 )            /*!< SPI: NSS Pin          */
#define SPI_NSS_LL_APB(__PORT__)                ((__PORT__ == 0) ? LL_APB1_GRP1_PERIPH_SPI2  : LL_APB2_GRP1_PERIPH_SPI1 )  /*!< SPI: NSS LL Group     */
#define SPI_NSS_LL_PORT(__PORT__)               ((__PORT__ == 0) ? LL_SYSCFG_EXTI_PORTB  : LL_SYSCFG_EXTI_PORTA )   /*!< SPI: NSS LL Port      */
#define SPI_NSS_LL_SYS_EXTI(__PORT__)           ((__PORT__ == 0) ? LL_SYSCFG_EXTI_LINE12 : LL_SYSCFG_EXTI_LINE15 )  /*!< SPI: NSS LL CFG EXTI Line */
#define SPI_NSS_LL_EXTI(__PORT__)               ((__PORT__ == 0) ? LL_EXTI_LINE_12 : LL_EXTI_LINE_15 )              /*!< SPI: NSS LL EXTI Line */
                                               /*!< SPI: NSS LL IRQn      */
#define SPI_NSS_LL_IRQPRIORITY(__PORT__)        ( RX_IRQ_PRIO )                            /*!< SPI: NSS LL IRQ priority */
#define SPI_NSS_LL_APB_EN_CLK(__PORT__)         ((__PORT__ == 0) ? LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_SPI2)  : LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SPI1) )
#define SPI_NSS_LL_APB_DIS_CLK(__PORT__)        ((__PORT__ == 0) ? LL_APB1_GRP1_DisableClock(LL_APB1_GRP1_PERIPH_SPI2)  : LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_SPI1) )

#define SPI_CLK_PORT(__PORT__)                  ( GPIOB )                                                           /*!< SPI: CLK Port         */
#define SPI_MISO_PORT(__PORT__)                 ( GPIOB )                                                           /*!< SPI: MISO Port        */
#define SPI_CLK_PIN(__PORT__)                   ((__PORT__ == 0) ? GPIO_PIN_13           : GPIO_PIN_3 )             /*!< SPI: CLK Pin          */
#define SPI_MISO_PIN(__PORT__)                  ((__PORT__ == 0) ? GPIO_PIN_14           : GPIO_PIN_4 )             /*!< SPI: MISO Pin         */
#if !defined(SPI_ONE_LINE)
#define SPI_MOSI_PIN(__PORT__)                  ((__PORT__ == 0) ? GPIO_PIN_15           : GPIO_PIN_5 )             /*!< SPI: MOSI Pin         */
#define SPI_MOSI_PORT(__PORT__)                 ( GPIOB )                                                           /*!< SPI: MOSI Port        */
#define SPI_MOSI_ALTERNATE(__PORT__)            ((__PORT__ == 0) ? GPIO_AF5_SPI2         : GPIO_AF5_SPI1 )          /*!< SPI: MOSI Alternate Function */
#endif
#define SPI_NSS_LL_IRQHANDLER(__PORT__)         ( EXTI15_10_IRQn ) 
#define SPI_CLK_ALTERNATE(__PORT__)             ((__PORT__ == 0) ? GPIO_AF5_SPI2         : GPIO_AF5_SPI1 )          /*!< SPI: CLK Alternate Function */
#define SPI_NSS_ALTERNATE(__PORT__)             ((__PORT__ == 0) ? GPIO_AF5_SPI2         : GPIO_AF5_SPI1 )          /*!< SPI: NSS Alternate Function */
#define SPI_MISO_ALTERNATE(__PORT__)            ((__PORT__ == 0) ? GPIO_AF5_SPI2         : GPIO_AF5_SPI1 )          /*!< SPI: MISO Alternate Function */
/* Definition for SPIx's NVIC */
#define SPI_IRQn(__PORT__)                       ((__PORT__ == 0) ? SPI2_IRQn            : SPI1_IRQn )
#define SPIx_IRQHandler(__PORT__)                ((__PORT__ == 0) ? SPI2_IRQHandler      : SPI1_IRQHandler )
#define SPIx_IRQ_PRIO(__PORT__)                 ( 0 )    /*!< SPI: IRQ priority  must be higher    */


/* DMA */
#define TX_DMACH(__PORT__)                      ((__PORT__ == 0) ? DMA1_Channel4            : DMA1_Channel2 )       /*!< DMA: Tx Channel       */
//#define RX_DMACH(__PORT__)                      ((__PORT__ == 0) ? DMA1_Channel3            : DMA1_Channel1 )       /*!< DMA: Rx Channel       */
#define TXDMACHIRQ(__PORT__)                      ((__PORT__ == 0) ? DMA1_Channel4_IRQn : DMA1_Channel2_IRQn) /*!< DMA: IRQn             */
//#define RXDMACHIRQ(__PORT__)                      ((__PORT__ == 0) ? DMA1_Channel3_IRQn : DMA1_Channel1_IRQn) /*!< DMA: IRQn             */
#if defined(DMAMUX_CxCR_DMAREQ_ID)
#define DMA_REQUEST_SPI_TX(__PORT__)              ((__PORT__ == 0) ? DMA_REQUEST_SPI2_TX : DMA_REQUEST_SPI1_TX) /*!< DMA: Requestr           */
//#define DMA_REQUEST_SPI_RX(__PORT__)              ((__PORT__ == 0) ? DMA_REQUEST_SPI2_RX : DMA_REQUEST_SPI1_RX) /*!< DMA: Requestr           */
#endif

#define TXDMACHIRQ_PRIO(__PORT__)                  (TX_IRQ_PRIO )                              /*!< DMA: IRQ priority     */
#define TXDMACHIRQ_SUB_PRIO(__PORT__)              (0)                              /*!< DMA: IRQ priority     */

#define SPARE_BIT_SUB_CORRECTION                 0
#define PHY_TXRX_BYTE_TIMEOUT                    50  /*!< Max time to recieve or send a byte Time Elapsed value [us]       */
#define SWCALL_RX_STOP(PORT)  LL_EXTI_GenerateSWI_0_31( SPI_NSS_PIN(PORT)) /* Macro Generating SWIE */
/**
  * @}
  */

/** @defgroup USBPD_DEVICE_PORTHANDLE_STUSB1602_MSP_MACRO MSP MACRO
  * @brief MACRO used by HAL MSP function to identify peripherals
 * @{
 */
#define GET_PORT_FROM_I2C(hi2c) \
( (uint8_t)( hi2c->Instance == I2C2)? 0 : 1 )   /*!< GET Port Number from I2C peripheral   */

#define I2C_CLK_ENABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_I2C2_CLK_ENABLE(); \
else \
  __HAL_RCC_I2C2_CLK_ENABLE();  \
} while(0)                                      /*!< Enables Clock of I2C peripheral for the specified port  */

#define I2C_CLK_DISABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_I2C2_CLK_DISABLE(); \
else \
  __HAL_RCC_I2C2_CLK_DISABLE();  \
} while(0)                                      /*!< Disables Clock of I2C peripheral for the specified port */

#define GET_PORT_FROM_SPI(hspi) \
( (uint8_t)( hspi->Instance == SPI_Instance(0) )? 0 : 1 )  /*!< GET Port Number from SPI peripheral   */

#define SPI_CLK_ENABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_SPI2_CLK_ENABLE(); \
else \
  __HAL_RCC_SPI1_CLK_ENABLE();  \
} while(0)                                      /*!< Enables Clock of SPI peripheral for the specified port  */

#define SPI_CLK_DISABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_SPI2_CLK_DISABLE(); \
else \
  __HAL_RCC_SPI1_CLK_DISABLE();  \
} while(0)                                      /*!< Disables Clock of SPI peripheral for the specified port */

#define SPI_FORCE_RESET(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_SPI2_FORCE_RESET(); \
else \
  __HAL_RCC_SPI1_FORCE_RESET();  \
} while(0)                                      /*!< Force Reset of SPI peripheral for the specified port           */

#define SPI_RELEASE_RESET(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_SPI2_RELEASE_RESET(); \
else \
  __HAL_RCC_SPI1_RELEASE_RESET();  \
} while(0)                                      /*!< Release Reset of SPI peripheral for the specified port         */

#define DMA_CLK_ENABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_DMA1_CLK_ENABLE(); \
else \
  __HAL_RCC_DMA1_CLK_ENABLE();   \
} while(0)                                      /*!< Enables Clock of DMA peripheral for the specified port  */

#define DMA_CLK_DISABLE(PortNum) do { \
if (PortNum==0) \
  __HAL_RCC_DMA1_CLK_DISABLE(); \
else \
  __HAL_RCC_DMA1_CLK_DISABLE();   \
} while(0)                                      /*!< Disables Clock of DMA peripheral for the specified port */


