usb-c/STUSB1602/firmware/FW_for_STM32L4R5/src/Drivers/BSP/P-NUCLEO-L4R5/p-nucleo-L4R5.h
#define TIM_CRC(TIM_identifier) ((TIM_identifier == TIM_PORT0_CRC )? TIM_PORT0_CRC:TIM_PORT1_CRC)

// #define USBPD_BSP_I2CxHandle                    hi2c2
#define STUSB1602_I2C_Add_0     					0x28 	/*<! Address 0 */
#define STUSB1602_I2C_Add_1     					0x29	/*<! Address 1 */
#define TIMEOUT_MAX             2000 /*<! The value of the maximal timeout for BUS waiting loops */

#define STUSB1602_I2C_Add(__PORT__)		((__PORT__ == 0) ? STUSB1602_I2C_Add_0 : STUSB1602_I2C_Add_1 )	/*!< I2C Address of the STUSB1602 device */


/**
  * @brief Leds on board P_NUCLEO_USB002
  *
  */ 
  typedef enum
  {
    ELED  = -1,
    ELED0 = 0,       /**<LED1 (green);  D107 of MB1303 X-NUCLEO */
    
    ELED1 = 1,       /**<LED01 (blue);  D100 of MB1303 X-NUCLEO */
    ELED2 = 2,       /**<LED02 (green); D101 of MB1303 X-NUCLEO */
    ELED3 = 3,       /**<LED03 (red);   D102 of MB1303 X-NUCLEO */
    
    ELED4 = 4,       /**<LED11 (blue);  D103 of MB1303 X-NUCLEO */
    ELED5 = 5,       /**<LED12 (green); D104 of MB1303 X-NUCLEO */
    ELED6 = 6,       /**<LED13 (red);   D105 of MB1303 X-NUCLEO */

    /* BSP name list */
    GREEN_USER_LED      = ELED0,

    LED_PORT0_CC        = ELED3,
    LED_PORT0_VBUS      = ELED2,
#if defined(__AUTHENTICATION__)
    /* In case of Authentication, LED01 and LED13 are mapped on 
       GPIOs used for I2C ST-SAFE communication. As only one port is handled,
       PORT0 Role is remapped on original PORT1 Role => ELED4 */
    LED_PORT0_ROLE      = ELED4,
#else
    LED_PORT0_ROLE      = ELED1,
#endif  /* __AUTHENTICATION__ */

    LED_PORT1_CC        = ELED6,
    LED_PORT1_VBUS      = ELED5,
    LED_PORT1_ROLE      = ELED4
  } USBPD_BSP_Led_TypeDef;

#define LED_PORT_ROLE(__PORT__) (__PORT__ == USBPD_PORT_0 ? LED_PORT0_ROLE : LED_PORT1_ROLE)  
#define LED_PORT_CC(__PORT__)   (__PORT__ == USBPD_PORT_0 ? LED_PORT0_CC : LED_PORT1_CC)
#define LED_PORT_VBUS(__PORT__) (__PORT__ == USBPD_PORT_0 ? LED_PORT0_VBUS : LED_PORT1_VBUS) 

#define DRP_pin                                 GPIO_PIN_8
#define DRP_port                                GPIOA

/**
  * @}
  */ 

#define BUTTONn                            1

/**
  * @brief User push-button
  */
#define USER_BUTTON_PIN                         GPIO_PIN_13
#define USER_BUTTON_GPIO_PORT                   GPIOC
#define USER_BUTTON_GPIO_CLK_ENABLE()         __HAL_RCC_GPIOC_CLK_ENABLE()   
#define USER_BUTTON_GPIO_CLK_DISABLE()        __HAL_RCC_GPIOC_CLK_DISABLE()  
#define USER_BUTTON_EXTI_LINE                   GPIO_PIN_13
#define USER_BUTTON_EXTI_IRQn                   EXTI15_10_IRQn
/* Aliases */
#define KEY_BUTTON_PIN                        USER_BUTTON_PIN
#define KEY_BUTTON_GPIO_PORT                  USER_BUTTON_GPIO_PORT
#define KEY_BUTTON_GPIO_CLK_ENABLE()          USER_BUTTON_GPIO_CLK_ENABLE()
#define KEY_BUTTON_GPIO_CLK_DISABLE()         USER_BUTTON_GPIO_CLK_DISABLE()
#define KEY_BUTTON_EXTI_LINE                  USER_BUTTON_EXTI_LINE
#define KEY_BUTTON_EXTI_IRQn                  USER_BUTTON_EXTI_IRQn

#define BUTTONx_GPIO_CLK_ENABLE(__INDEX__)    do { if((__INDEX__) == 0) USER_BUTTON_GPIO_CLK_ENABLE();} while(0)
#define BUTTONx_GPIO_CLK_DISABLE(__INDEX__)   (((__INDEX__) == 0) ? USER_BUTTON_GPIO_CLK_DISABLE() : 0)
/**
  * @}
  */ 

typedef enum 
{  
  BUTTON_USER = 0,
  /* Alias */
  BUTTON_KEY  = BUTTON_USER
} Button_TypeDef;

typedef enum 
{  
  BUTTON_MODE_GPIO = 0,
  BUTTON_MODE_EXTI = 1
} ButtonMode_TypeDef; 
  
/* Exported define -----------------------------------------------------------*/
/** @defgroup P-NUCLEO-USB002_Exported_Constants Exported Constants     */


#define HW_IF_ADC        ADC1
/* ADC Exported define for MB1303 board */
#if (USBPD_PORT_COUNT == 1)
#define USBPD_ADCn    3                                    /*!< Number of Analog channel used by ADC */
#define USBPD_ADC_INT_CHANNEL    0          /*!< Number of internal channel used */     
#define ADCCONVERTEDVALUES_BUFFER_SIZE    3 /*!< Size of array containing ADC converted values: set to ADC sequencer number of ranks converted, to have a rank in each address */
#define VBUS_INDEX(__PORT__)    ( 0 )                      /*!< Index of the VBus channel for the specified Port inside @ref ADCxConvertedValues */
#define IBUS_INDEX(__PORT__)    ( 1 )                      /*!< Index of the IBus channel for the specified Port inside @ref ADCxConvertedValues */
#elif (USBPD_PORT_COUNT == 2)
#define USBPD_ADCn    5                                     /*!< Number of Analog channel used by ADC */
#define USBPD_ADC_INT_CHANNEL    0          /*!< Number of internal channel used */     
#define ADCCONVERTEDVALUES_BUFFER_SIZE    5 /*!< Size of array containing ADC converted values: set to ADC sequencer number of ranks converted, to have a rank in each address */
#define VBUS_INDEX(__PORT__)    ((__PORT__ == 0) ? 0 : 3)  /*!< Index of the VBus channel for the specified Port inside @ref ADCxConvertedValues */
#define IBUS_INDEX(__PORT__)    ((__PORT__ == 0) ? 1 : 4)  /*!< Index of the IBus channel for the specified Port inside @ref ADCxConvertedValues */
#endif

#if defined (P_NUCLEO_L4R5_C)
ADC_HandleTypeDef   usbpdm1_hadc;           /*!< Handle of ADC peripheral */
DMA_HandleTypeDef   DmaHandle;              /*!< Handle of DMA peripheral */
uint32_t   ADCxConvertedValues[ADCCONVERTEDVALUES_BUFFER_SIZE]; /*!< Array that stores ADC sampled values */
#else 
extern ADC_HandleTypeDef   usbpdm1_hadc;           /*!< Handle of ADC peripheral */
extern DMA_HandleTypeDef   DmaHandle;              /*!< Handle of DMA peripheral */
extern uint32_t   ADCxConvertedValues[]; /*!< Array that stores ADC sampled values */
#endif 
static const USBPD_BSP_GPIOADCPins_TypeDef USBPD_ADCs[USBPD_ADCn] =
{
  USBPD_BSP_ADC(GPIOC, 4, ADC_CHANNEL_13, ADC_REGULAR_RANK_1), /*ADC0 on schematic - VBUS port0*/
  USBPD_BSP_ADC(GPIOA, 7, ADC_CHANNEL_12, ADC_REGULAR_RANK_2),  /*ADC1 on schematic - IBUS port0*/
  USBPD_BSP_ADC(GPIOC, 0, ADC_CHANNEL_1, ADC_REGULAR_RANK_3),  /*ADC4 on schematic - PowConn17*/
#if (USBPD_PORT_COUNT == 2)
  USBPD_BSP_ADC(GPIOB, 0, ADC_CHANNEL_15,ADC_REGULAR_RANK_4),  /*ADC2 on schematic - VBUS port1*/
  USBPD_BSP_ADC(GPIOA, 4, ADC_CHANNEL_9, ADC_REGULAR_RANK_5),  /*ADC3 on schematic - IBUS port1*/
#endif
} ;

