usb-c/STUSB1602/firmware/FW_for_STM32L4R5/src/Drivers/BSP/P-NUCLEO-L4R5/p-nucleo-L4R5.h
/* Macro for ADCx DMA resources */
#define ADCx_CLK_ENABLE()               __HAL_RCC_ADC_CLK_ENABLE()         /*!< Enables clock of ADC device  */
#define ADCx_FORCE_RESET()              __HAL_RCC_ADC_FORCE_RESET()        /*!< Forces reset of ADC device   */
#define ADCx_RELEASE_RESET()            __HAL_RCC_ADC_RELEASE_RESET()      /*!< Releases reset of ADC device   */
#define ADCx_DMA_CLK_ENABLE()           __HAL_RCC_DMA1_CLK_ENABLE()         /*!< Enables clock of DMA device   */
#define ADCx_DMA                        DMA1_Channel7                       /*!< DMA channel for ADC       */
#define ADCx_DMA_IRQn                   DMA1_Channel7_IRQn
#define ADCx_DMA_IRQHandler             DMA1_Channel7_IRQHandler
#define ADCx_DMAMUX_CLK_ENABLE()          __HAL_RCC_DMAMUX1_CLK_ENABLE();

#define TEMP(X)     ( ( ((uint32_t)X)*1024 )>>10 ) 
//#define MVOLTVBUS(X)  ( ( ( ( (uint32_t)X) * 20151 ) ) >> 12 )
//#define MVOLTAGE(X)  ( ( ( ( (uint32_t)X) * 11 * 3300  ) ) >> 12 )
#define MVOLTAGE(X)  ( ( ( ( (uint32_t)X) * 3300 * (82+15)) >> 12 ) / 15 ) 

#define MVOLTVSRC(X)  ( ( ( ( (uint32_t)X) * 11 * 3300 ) ) >> 12 )
//#define MAMPIBUS(X)         ( ( ((uint32_t)X)*825 )>>10 )
//#define    codemax  (uint16_t) (4096*225/330)
//#define MAMPIBUS(X)           (uint32_t) (X * 3000  / codemax)
#define MVOLTVINADC(X) ( ( ( ( (uint32_t)X) * 20151 ) ) >> 12 )
/**
 * 50Vs - VDDA/2 = Vadcin
 * */
/* 5A means 5A*5mOhms = 2.5V. ADC excursion: 3.3V. ==> 3.3V means 6.6A*/
/* 5A * 5E-3Ohms * 50V/V = 1.25V  */
/* Vref current sensing = 3.3/2 = 1.65 */

#define MAMP(X)    (( (int32_t)((X*3300)>>10)-6600 ))      /*!< Macro to convert ADC value into mA  */
#if defined(USBPD_CLI)
#if defined (HAL_UART_MODULE_ENABLED) 
#if defined (P_NUCLEO_L4R5_C)
UART_HandleTypeDef huart_handle;
void USBPD_BSP_UART_Init(void);
#else 
extern UART_HandleTypeDef huart_handle;
extern void USBPD_BSP_UART_Init(void);
#endif 
#endif /* HAL_UART_MODULE_ENABLED */
#define USBPD_BSP_USART_IRQHandler              USART1_IRQHandler
#endif /* USBPD_CLI */

#define USBPD_BSP_LEDn                          7
#define USBPD_BSP_LED_LEN                       USBPD_BSP_LEDn

/**
  * @}
  */

#define USBPD_POWSELn    ((USBPD_PORT_COUNT) * 2)

static const USBPD_BSP_GPIOPins_TypeDef USBPD_POWSELs[USBPD_POWSELn] =
{
  USBPD_BSP_PIN(GPIOB,7),
  USBPD_BSP_PIN(GPIOB,6),
#if USBPD_PORT_COUNT == 2
  USBPD_BSP_PIN(GPIOC,1),
  USBPD_BSP_PIN(GPIOC,9),
#endif
};

/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
    
/* Exported variables --------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @addtogroup P-NUCLEO-USB002_Exported_Functions
  * @{
  */
#if defined(_GUI_INTERFACE)
const uint8_t*          BSP_GetHWBoardVersionName(void);
const uint8_t*          BSP_GetPDTypeName(void);
#endif /* _GUI_INTERFACE */

    /**
      * @brief  Configures P_NUCLEO_USB002 LED GPIO.
      * @param  None
      * @retval None
      */
    void USBPD_BSP_LED_Init(void);

    /**
      * @brief  Turns selected LED On.
      * @param  Led: Specifies the Led to be set on.
      * @retval None
      */
    void USBPD_BSP_LED_On(USBPD_BSP_Led_TypeDef Led);

    /**
      * @brief  Turns selected LED On or Off.
      * @param  Led: Specifies the Led to be set on.
      * @param  Value: value to set the led on or off.
      * @retval None
      */
    void USBPD_BSP_LED_Set(USBPD_BSP_Led_TypeDef Led, uint8_t Value);    
    
    /**
      * @brief  Turns selected LED Off.
      * @param  Led: Specifies the Led to be set off.
      * @retval None
      */
    void USBPD_BSP_LED_Off(USBPD_BSP_Led_TypeDef Led);

    /**
      * @brief  Toggles the selected LED.
      * @param  Led: Specifies the Led to be toggled.
      * @retval None
      */
    void USBPD_BSP_LED_Toggle(USBPD_BSP_Led_TypeDef Led);
    HAL_StatusTypeDef APPLI_Set_Current_Limit(uint8_t PortNum ,uint32_t IbusInmA);

void      BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode);
void      BSP_PB_DeInit(Button_TypeDef Button);
uint32_t  BSP_PB_GetState(Button_TypeDef Button);
    


/* STUSB16xx_EVAL exported function prototypes */
void            HW_IF_ADC_Init(void);
void            HW_IF_ADCAnalogGPIO_Init(void);
void            HW_IF_ADCAnalogGPIO_DeInit(void);
void            HW_IF_ADCDMA_Init(void);
void            HW_IF_ADCDMA_DeInit(void);



#ifndef MB1303
uint16_t APPLI_GetTemp(uint8_t PortNum);
uint16_t APPLI_GetVsrc(uint8_t PortNum);
#endif /*MB1303*/
int16_t APPLI_GetIvbus(uint8_t PortNum);
uint16_t APPLI_GetVBUS(uint8_t PortNum);
uint16_t APPLI_GetVINADC(uint8_t PortNum);

HAL_StatusTypeDef APPLI_SetVoltage(uint8_t PortNum ,uint32_t vbus_vvar);
void BSP_USBPD_SetVoltage(uint32_t Port, uint32_t Voltage);
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#else
/*#warning "P-Nucleo header eof2"*/
#endif /* __P_NUCLEO_L4R5_H_ */  
/*#warning "P-Nucleo header eof"*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
